OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_SPI/Driver_SPI.c
// Local driver functions declarations (for instances)
#if (RTE_SPI_SPI0 == 1)
    SPI_INFO_DEFINE(SPI_SPI_IDX0)
#endif
#if (RTE_SPI_SPI1 == 1)
    SPI_INFO_DEFINE(SPI_SPI_IDX1)
#endif
#if (RTE_SPI_SPI2 == 1)
    SPI_INFO_DEFINE(SPI_SPI_IDX2)
#endif
#if (RTE_SPI_SPI3 == 1)
    SPI_INFO_DEFINE(SPI_SPI_IDX3)
#endif

// List of available SPI instance infos
static const SPI_RESOURCES *const spi_res_list[] =
{
#if defined(RTE_SPI_SPI0) && (RTE_SPI_SPI0 == 1)
    &SPI_RES_NAME(SPI_SPI_IDX0),
#else
    NULL,
#endif

#if defined(RTE_SPI_SPI1) && (RTE_SPI_SPI1 == 1)
    &SPI_RES_NAME(SPI_SPI_IDX1),
#else
    NULL,
#endif

#if defined(RTE_SPI_SPI2) && (RTE_SPI_SPI2 == 1)
    &SPI_RES_NAME(SPI_SPI_IDX2),
#else
    NULL,
#endif

#if defined(RTE_SPI_SPI3) && (RTE_SPI_SPI3 == 1)
    &SPI_RES_NAME(SPI_SPI_IDX3),
#else
    NULL,
#endif

    NULL,
};

/* Local Functions */
static ARM_DRIVER_VERSION SPIn_GetVersion(void);
static ARM_SPI_CAPABILITIES SPIn_GetCapabilities(void);
static int32_t SPIn_Initialize(uint32_t u32Inst, ARM_SPI_SignalEvent_t cb_event);
static int32_t SPIn_Uninitialize(uint32_t u32Inst);
static int32_t SPIn_PowerControl(uint32_t u32Inst, ARM_POWER_STATE state);
static int32_t SPIn_Send(uint32_t u32Inst, const void *pvTxData, uint32_t u32Size);
static int32_t SPIn_Receive(uint32_t u32Inst, void *pvRxData, uint32_t u32Size);
static int32_t SPIn_Transfer(uint32_t u32Inst, const void *data_out, void *data_in, uint32_t num);
static uint32_t SPIn_GetDataCount(uint32_t u32Inst);
static int32_t SPIn_Control(uint32_t u32Inst, uint32_t control, uint32_t arg);
static ARM_SPI_STATUS SPIn_GetStatus(uint32_t u32Inst);

static int32_t SPI_PrepareDefaultRxBuffer(SPI_RESOURCES *pSPIn, uint32_t u32DataBits, uint32_t u32Num);
static int32_t SPI_PrepareDefaultTxBuffer(SPI_RESOURCES *pSPIn, uint32_t u32DataBits, uint32_t u32Num);
static void SPI_ReleaseDefaultTxBuffer(SPI_RESOURCES *pSPIn);
static void SPI_PDMA_TXInit(SPI_RESOURCES *pSPIn);
static void SPI_PDMA_RXInit(SPI_RESOURCES *pSPIn);

#if (RTE_SPI_SPI0 == 1)
    FUNCS_DECLARE(SPI_SPI_IDX0)
#endif
#if (RTE_SPI_SPI1 == 1)
    FUNCS_DECLARE(SPI_SPI_IDX1)
#endif
#if (RTE_SPI_SPI2 == 1)
    FUNCS_DECLARE(SPI_SPI_IDX2)
#endif
#if (RTE_SPI_SPI3 == 1)
    FUNCS_DECLARE(SPI_SPI_IDX3)
#endif

//------------------------------------------------------------------------------

// Driver Version
static const ARM_DRIVER_VERSION DriverVersion =
{
    ARM_SPI_API_VERSION,
    0x100
};

// Driver Capabilities
static const ARM_SPI_CAPABILITIES DriverCapabilities =
{
    1U,  // Simplex Mode (Master and Slave)
    0U,  // TI Synchronous Serial Interface
    0U,  // Microwire Interface
    0U,  // Signal Mode Fault event: \ref ARM_SPI_EVENT_MODE_FAULT
    0U   // Reserved
};

//------------------------------------------------------------------------------
static uint32_t SPI_GetActiveDataLostMask(const SPI_RESOURCES *pSPIn)
{
    uint32_t u32Mask = 0U;

    if ((pSPIn->sState.u32Mode & ARM_SPI_MODE_SLAVE) != 0U)
    {
        u32Mask |= SPI_SLAVE_DATA_LOST_INT_MASK;
    }

    if (pSPIn->sXfer.pu8RxBuf != NULL)
    {
        u32Mask |= SPI_FIFO_RXOV_INT_MASK;
    }

    return u32Mask;
}

static void SPI_HandleDataLost(SPI_RESOURCES *pSPIn, uint32_t u32DataLostMask)
{
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;

    SPI_ClearIntFlag(phspi, u32DataLostMask);
    SPI_DisableInt(phspi, SPI_DATA_LOST_INT_MASK | SPI_FIFO_TXTH_INT_MASK | SPI_FIFO_RXTO_INT_MASK);

    if (pSPIn->spdma.i32TxChnId != -1)
    {
        nu_pdma_channel_terminate(pSPIn->spdma.i32TxChnId);
    }

    if (pSPIn->spdma.i32RxChnId != -1)
    {
        nu_pdma_channel_terminate(pSPIn->spdma.i32RxChnId);
    }

    SPI_DISABLE_TX_RX_PDMA(phspi);
    SPI_ReleaseDefaultTxBuffer(pSPIn);

    if (pSPIn->sState.sDrvStatus.u8Busy == 0U)
    {
        return;
    }

    pSPIn->sState.sDrvStatus.u8Busy = 0U;
    pSPIn->sState.sDrvStatus.u8DataLost = 1U;

    if (pSPIn->sState.cb_event)
    {
        pSPIn->sState.cb_event(ARM_SPI_EVENT_DATA_LOST);
    }
}

static void SPI_PDMA_RX_CB(void *ptr_priv, uint32_t event)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)ptr_priv;
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;
    uint32_t u32ActiveDataLostMask = SPI_GetActiveDataLostMask(pSPIn);
    uint32_t u32DataBits = ((phspi->CTL & SPI_CTL_DWIDTH_Msk) >> SPI_CTL_DWIDTH_Pos);
    uint32_t item_size = (u32DataBits == 0) ? 4 : ((u32DataBits + 7U) / 8U);
    uint32_t u32DataLostMask = 0U;
    volatile int32_t u32TimeoutCnt = SystemCoreClock / 1000;

    while ((SPI_IS_BUSY(phspi) || ((phspi->STATUS & SPI_STATUS_RXCNT_Msk) != 0)) && (--u32TimeoutCnt > 0)) {}

    if (event & NU_PDMA_EVENT_TRANSFER_DONE)
    {
        pSPIn->sXfer.u32RxCnt = pSPIn->sXfer.u32Num;
    }
    else
    {
        uint32_t bytes = nu_pdma_transferred_byte_get(pSPIn->spdma.i32RxChnId, pSPIn->sXfer.u32Num * item_size);
        pSPIn->sXfer.u32RxCnt = bytes / item_size;
    }

    if ((u32ActiveDataLostMask & SPI_SLVUR_INT_MASK) && SPI_GetIntFlag(phspi, SPI_SLVUR_INT_MASK))
    {
        u32DataLostMask |= SPI_SLVUR_INT_MASK;
    }

    if ((u32ActiveDataLostMask & SPI_SLVBE_INT_MASK) && SPI_GetIntFlag(phspi, SPI_SLVBE_INT_MASK))
    {
        u32DataLostMask |= SPI_SLVBE_INT_MASK;
    }

    if ((u32ActiveDataLostMask & SPI_TXUF_INT_MASK) && SPI_GetIntFlag(phspi, SPI_TXUF_INT_MASK))
    {
        u32DataLostMask |= SPI_TXUF_INT_MASK;
    }

    if ((u32ActiveDataLostMask & SPI_FIFO_RXOV_INT_MASK) && SPI_GetIntFlag(phspi, SPI_FIFO_RXOV_INT_MASK))
    {
        u32DataLostMask |= SPI_FIFO_RXOV_INT_MASK;
    }

    if (u32DataLostMask != 0U)
    {
        SPI_HandleDataLost(pSPIn, u32DataLostMask);
        return;
    }

    if ((pSPIn->sXfer.u32TxCnt >= pSPIn->sXfer.u32Num ||
            pSPIn->sXfer.pu8TxBuf == NULL) &&
            (pSPIn->sXfer.u32RxCnt >= pSPIn->sXfer.u32Num ||
             pSPIn->sXfer.pu8RxBuf == NULL) &&
            pSPIn->sState.sDrvStatus.u8Busy)
    {
        SPI_DisableInt(phspi, u32ActiveDataLostMask);
        SPI_DISABLE_TX_RX_PDMA(phspi);

        SPI_ReleaseDefaultTxBuffer(pSPIn);

        pSPIn->sState.sDrvStatus.u8Busy = 0U;

