OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_SPI/Driver_SPI.c
        if (pSPIn->sState.cb_event)
            pSPIn->sState.cb_event(ARM_SPI_EVENT_TRANSFER_COMPLETE);
    }
}

static void SPI_PDMA_TX_CB(void *ptr_priv, uint32_t event)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)ptr_priv;
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;
    uint32_t u32ActiveDataLostMask = SPI_GetActiveDataLostMask(pSPIn);
    uint32_t u32DataBits = ((phspi->CTL & SPI_CTL_DWIDTH_Msk) >> SPI_CTL_DWIDTH_Pos);
    uint32_t item_size = (u32DataBits == 0) ? 4 : ((u32DataBits + 7U) / 8U);
    uint32_t u32DataLostMask = 0U;
    volatile int32_t u32TimeoutCnt = SystemCoreClock / 1000;

    while ((SPI_IS_BUSY(phspi) || ((phspi->STATUS & SPI_STATUS_TXCNT_Msk) != 0)) && (--u32TimeoutCnt > 0)) {}

    if (event & NU_PDMA_EVENT_TRANSFER_DONE)
    {
        pSPIn->sXfer.u32TxCnt = pSPIn->sXfer.u32Num;
    }
    else
    {
        uint32_t bytes = nu_pdma_transferred_byte_get(pSPIn->spdma.i32TxChnId, pSPIn->sXfer.u32Num * item_size);
        pSPIn->sXfer.u32TxCnt = bytes / item_size;
    }

    if ((u32ActiveDataLostMask & SPI_SLVUR_INT_MASK) && SPI_GetIntFlag(phspi, SPI_SLVUR_INT_MASK))
    {
        u32DataLostMask |= SPI_SLVUR_INT_MASK;
    }

    if ((u32ActiveDataLostMask & SPI_SLVBE_INT_MASK) && SPI_GetIntFlag(phspi, SPI_SLVBE_INT_MASK))
    {
        u32DataLostMask |= SPI_SLVBE_INT_MASK;
    }

    if ((u32ActiveDataLostMask & SPI_TXUF_INT_MASK) && SPI_GetIntFlag(phspi, SPI_TXUF_INT_MASK))
    {
        u32DataLostMask |= SPI_TXUF_INT_MASK;
    }

    if ((u32ActiveDataLostMask & SPI_FIFO_RXOV_INT_MASK) && SPI_GetIntFlag(phspi, SPI_FIFO_RXOV_INT_MASK))
    {
        u32DataLostMask |= SPI_FIFO_RXOV_INT_MASK;
    }

    if (u32DataLostMask != 0U)
    {
        SPI_HandleDataLost(pSPIn, u32DataLostMask);
        return;
    }

    if ((pSPIn->sXfer.u32TxCnt >= pSPIn->sXfer.u32Num ||
            pSPIn->sXfer.pu8TxBuf == NULL) &&
            (pSPIn->sXfer.u32RxCnt >= pSPIn->sXfer.u32Num ||
             pSPIn->sXfer.pu8RxBuf == NULL) &&
            pSPIn->sState.sDrvStatus.u8Busy)
    {
        //SPI_ClearIntFlag(phspi, SPI_FIFO_TXTH_INT_MASK | SPI_FIFO_RXTO_INT_MASK);
        //SPI_DisableInt(phspi, SPI_FIFO_TXTH_INT_MASK | SPI_FIFO_RXTO_INT_MASK); // Disable TX FIFO threshold interrupt
        SPI_DisableInt(phspi, u32ActiveDataLostMask);
        SPI_DISABLE_TX_RX_PDMA(phspi);
        SPI_ReleaseDefaultTxBuffer(pSPIn);
        pSPIn->sState.sDrvStatus.u8Busy = 0U;

        if (pSPIn->sState.cb_event)
            pSPIn->sState.cb_event(ARM_SPI_EVENT_TRANSFER_COMPLETE);
    }
}

static inline void SPI_StoreRxData(SPI_RESOURCES *pSPIn, uint32_t u32RxData, uint32_t u32DataBits)
{
    uint32_t index = pSPIn->sXfer.u32RxCnt;

    if (pSPIn->sXfer.pu8RxBuf == NULL) return;  // Dummy read case

    if ((u32DataBits <= 8) && (u32DataBits != 0))
    {
        pSPIn->sXfer.pu8RxBuf[index] = (uint8_t)u32RxData;
    }
    else if ((u32DataBits <= 16) && (u32DataBits != 0))
    {
        ((uint16_t *)pSPIn->sXfer.pu8RxBuf)[index] = (uint16_t)u32RxData;
    }
    else
    {
        ((uint32_t *)pSPIn->sXfer.pu8RxBuf)[index] = u32RxData;
    }
}

static void SPI_RxIRQHandler(uint32_t u32Inst, uint32_t u32DataBits, uint32_t u32PatternMask)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = pSPIn->phspi;
    uint32_t au32RxBuf[8] = {0};  // Local temporary buffer for batch RX from FIFO
    uint32_t u32Count = 0, u32i = 0;

    // Step 1: Batch read all available data from RX FIFO (store raw data first)
    while (!SPI_GET_RX_FIFO_EMPTY_FLAG(phspi) &&
            (u32Count < SPI_ARRAY_SIZE(au32RxBuf)) &&
            ((pSPIn->sXfer.u32RxCnt + u32Count) < pSPIn->sXfer.u32Num))
    {
        au32RxBuf[u32Count++] = SPI_READ_RX(phspi);
    }

    // Step 2: Process DataBits conversion after raw data is fetched
    for (u32i = 0; u32i < u32Count; u32i++)
    {
        uint32_t raw = au32RxBuf[u32i] & u32PatternMask;
        SPI_StoreRxData(pSPIn, raw, u32DataBits);
        pSPIn->sXfer.u32RxCnt++;
    }
}

static void SPI_TxIRQHandler(uint32_t u32Inst, uint32_t u32DataBits, uint32_t u32PatternMask)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;
    uint8_t  *pu8TxBuf  = pSPIn->sXfer.pu8TxBuf;
    uint16_t *pu16TxBuf = (uint16_t *)pSPIn->sXfer.pu8TxBuf;
    uint32_t *pu32TxBuf = (uint32_t *)pSPIn->sXfer.pu8TxBuf;
    uint32_t u32TxData = 0;

    // Half-Duplex mode handling TX
    if ((pSPIn->sConfig.u32XferMode == RTE_SPI_HALF_XFER_MODE) &&
            (pSPIn->sXfer.pu8TxBuf == NULL))
    {
        return;
    }

    // Check TX FIFO not full and there's data left to send
    while ((!SPI_GET_TX_FIFO_FULL_FLAG(phspi)) &&
            (pSPIn->sXfer.u32TxCnt < pSPIn->sXfer.u32Num))
    {
        if (pu8TxBuf == NULL)
        {
            u32TxData = pSPIn->sXfer.u32DefVal;
        }
        else
        {
            // Retrieve data and mask accurately based on DataBits.
            if ((u32DataBits <= 8) && (u32DataBits != 0))
            {
                u32TxData = (uint8_t)(pu8TxBuf[pSPIn->sXfer.u32TxCnt]);
            }
            else if ((u32DataBits <= 16) && (u32DataBits != 0))
            {
                u32TxData = (uint16_t)(pu16TxBuf[pSPIn->sXfer.u32TxCnt]);
            }
            else // default write as 32-bit
            {
                u32TxData = (uint32_t)(pu32TxBuf[pSPIn->sXfer.u32TxCnt]);
            }
        }

        phspi->TX = (u32TxData & u32PatternMask);
        pSPIn->sXfer.u32TxCnt++;
    }

    // Transmission completed, disable interrupt
    if ((SPI_IS_BUSY(phspi) == 0) && (pSPIn->sXfer.u32TxCnt >= pSPIn->sXfer.u32Num))
    {
        SPI_ClearIntFlag(phspi, SPI_FIFO_TXTH_INT_MASK);
        SPI_DisableInt(phspi, SPI_FIFO_TXTH_INT_MASK); // Disable TX FIFO threshold interrupt
    }
}

// SPI interrupt handler
static void SPI_IRQHandler(uint32_t u32Inst)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;
    uint32_t u32ActiveDataLostMask = SPI_GetActiveDataLostMask(pSPIn);
    uint32_t u32DataBits = ((phspi->CTL & SPI_CTL_DWIDTH_Msk) >> SPI_CTL_DWIDTH_Pos);
    uint32_t u32PatternMask = (0xFFFFFFFF >> (32 - ((u32DataBits == 0) ? 32 : u32DataBits)));
    uint32_t u32DataLostMask = 0U;

    if (SPI_GetIntFlag(phspi, SPI_SSINACT_INT_MASK))
    {
        SPI_ClearIntFlag(phspi, SPI_SSINACT_INT_MASK);
    }

    if ((u32ActiveDataLostMask & SPI_SLVUR_INT_MASK) && SPI_GetIntFlag(phspi, SPI_SLVUR_INT_MASK))
    {
        u32DataLostMask |= SPI_SLVUR_INT_MASK;
    }

