OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_SPI/Driver_SPI.c
    if ((u32ActiveDataLostMask & SPI_SLVBE_INT_MASK) && SPI_GetIntFlag(phspi, SPI_SLVBE_INT_MASK))
    {
        u32DataLostMask |= SPI_SLVBE_INT_MASK;
    }

    if ((u32ActiveDataLostMask & SPI_TXUF_INT_MASK) && SPI_GetIntFlag(phspi, SPI_TXUF_INT_MASK))
    {
        u32DataLostMask |= SPI_TXUF_INT_MASK;
    }

    if ((u32ActiveDataLostMask & SPI_FIFO_RXOV_INT_MASK) && SPI_GetIntFlag(phspi, SPI_FIFO_RXOV_INT_MASK))
    {
        u32DataLostMask |= SPI_FIFO_RXOV_INT_MASK;
    }

    if (u32DataLostMask != 0U)
    {
        SPI_ClearIntFlag(phspi, u32DataLostMask);
        SPI_DisableInt(phspi, SPI_DATA_LOST_INT_MASK | SPI_FIFO_TXTH_INT_MASK | SPI_FIFO_RXTO_INT_MASK);
        pSPIn->sState.sDrvStatus.u8Busy = 0U;
        pSPIn->sState.sDrvStatus.u8DataLost = 1U;

        if (pSPIn->sState.cb_event)
        {
            pSPIn->sState.cb_event(ARM_SPI_EVENT_DATA_LOST);
        }

        return;
    }

    if (SPI_GetIntFlag(phspi, SPI_FIFO_RXTO_INT_MASK))
    {
        SPI_ClearIntFlag(phspi, SPI_FIFO_RXTO_INT_MASK);
        SPI_RxIRQHandler(u32Inst, u32DataBits, u32PatternMask);
    }

    if (!SPI_GET_TX_FIFO_FULL_FLAG(phspi))
    {
        SPI_TxIRQHandler(u32Inst, u32DataBits, u32PatternMask);
    }

    if (!SPI_GET_RX_FIFO_EMPTY_FLAG(phspi))
    {
        SPI_RxIRQHandler(u32Inst, u32DataBits, u32PatternMask);
    }

    // Relax the Transfer Complete condition
    if ((pSPIn->sXfer.u32RxCnt >= pSPIn->sXfer.u32Num) &&
            (pSPIn->sXfer.u32TxCnt >= pSPIn->sXfer.u32Num) &&
            SPI_GET_TX_FIFO_EMPTY_FLAG(phspi) &&
            (!SPI_IS_BUSY(phspi)))
    {
        pSPIn->sState.sDrvStatus.u8Busy = 0U;

        if (pSPIn->sState.cb_event)
        {
            pSPIn->sState.cb_event(ARM_SPI_EVENT_TRANSFER_COMPLETE);
        }
    }
}

// Configure SPI interrupt
static void SPI_InterruptConfig(uint32_t u32Inst, uint32_t u32IntEn)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;
    IRQn_Type irq_n = SPI0_IRQn; // Default SPI0 interrupt
    uint32_t u32RegLockLevel = SYS_IsRegLocked();

    // Select the corresponding interrupt number based on the SPI instance
    irq_n = ((uint32_t)phspi == (uint32_t)SPI0) ? SPI0_IRQn :
            ((uint32_t)phspi == (uint32_t)SPI1) ? SPI1_IRQn :
            ((uint32_t)phspi == (uint32_t)SPI2) ? SPI2_IRQn :
            ((uint32_t)phspi == (uint32_t)SPI3) ? SPI3_IRQn :
            SPI0_IRQn;

    /* Unlock protected registers */
    if (u32RegLockLevel)
    {
        SYS_UnlockReg();
    }

    if (u32IntEn == SPI_OP_ENABLE)
    {
        // Enable the corresponding SPI interrupt
        NVIC_EnableIRQ(irq_n);
    }
    else
    {
        // Disable the corresponding SPI interrupt
        NVIC_DisableIRQ(irq_n);
    }

    /* Lock protected registers */
    if (u32RegLockLevel)
    {
        SYS_LockReg();
    }
}

/**
  \fn          ARM_DRIVER_VERSION SPI_GetVersion (void)
  \brief       Get SPI driver version.
  \return      \ref ARM_DRV_VERSION
*/
static ARM_DRIVER_VERSION SPIn_GetVersion(void)
{
    return DriverVersion;
}

/**
  \fn          ARM_SPI_CAPABILITIES SPI_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      \ref ARM_SPI_CAPABILITIES
*/
static ARM_SPI_CAPABILITIES SPIn_GetCapabilities(void)
{
    return DriverCapabilities;
}

/**
  \fn          int32_t SPI_Initialize (ARM_SPI_SignalEvent_t cb_event)
  \brief       Initialize SPI Interface.
  \param[in]   cb_event  Pointer to \ref ARM_SPI_SignalEvent
  \return      \ref execution_status
*/
static int32_t SPIn_Initialize(uint32_t u32Inst, ARM_SPI_SignalEvent_t cb_event)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];

    if (pSPIn->sState.u8State & SPI_INITIALIZED) return ARM_DRIVER_OK;

    // Initialize SPI Run-Time Resources
    pSPIn->sState.cb_event = cb_event;
    pSPIn->sState.sDrvStatus.u8Busy = 0U;
    pSPIn->sState.sDrvStatus.u8DataLost = 0U;
    pSPIn->sState.sDrvStatus.u8ModeFault = 0U;

    // Clear transfer information
    memset(&pSPIn->sXfer, 0, sizeof(SPI_TRANSFER_INFO));

    // Terminate and free RX PDMA channel if used
    if (pSPIn->spdma.u32RxUsed == 1)
    {
        if ((pSPIn->spdma.i32RxChnId >= 0) &&
                (pSPIn->spdma.i32RxChnId < (int32_t)(PDMA_CH_MAX * PDMA_CNT)))
        {
            nu_pdma_channel_terminate(pSPIn->spdma.i32RxChnId);
            nu_pdma_channel_free(pSPIn->spdma.i32RxChnId);
        }
    }

    // Terminate and free TX PDMA channel if used
    if (pSPIn->spdma.u32TxUsed == 1)
    {
        if ((pSPIn->spdma.i32TxChnId >= 0) &&
                (pSPIn->spdma.i32TxChnId < (int32_t)(PDMA_CH_MAX * PDMA_CNT)))
        {
            nu_pdma_channel_terminate(pSPIn->spdma.i32TxChnId);
            nu_pdma_channel_free(pSPIn->spdma.i32TxChnId);
        }
    }

    // Reset PDMA channel IDs
    pSPIn->spdma.i32RxChnId = -1;
    pSPIn->spdma.i32TxChnId = -1;

    pSPIn->sState.u8State = SPI_INITIALIZED; // SPI is initialized

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SPI_Uninitialize (void)
  \brief       De-initialize SPI Interface.
  \return      \ref execution_status
*/
static int32_t SPIn_Uninitialize(uint32_t u32Inst)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;

    SPI_InterruptConfig(u32Inst, SPI_OP_DISABLE); // Disable SPI interrupts

    SPI_Close(phspi);

    // Free PDMA channels
    if (pSPIn->spdma.i32RxChnId != -1)
    {
        nu_pdma_channel_free(pSPIn->spdma.i32RxChnId);
        pSPIn->spdma.i32RxChnId = -1;
    }

    if (pSPIn->spdma.i32TxChnId != -1)
    {
        nu_pdma_channel_free(pSPIn->spdma.i32TxChnId);
        pSPIn->spdma.i32TxChnId = -1;
    }

    pSPIn->sState.u8State = 0U;  // SPI is uninitialized

    memset(&pSPIn->sState.sDrvStatus, 0, sizeof(SPI_DRV_STATUS)); // Clear driver status

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SPI_PowerControl (ARM_POWER_STATE state)
  \brief       Control SPI Interface Power.
  \param[in]   state  Power state
  \return      \ref execution_status
*/
static int32_t SPIn_PowerControl(uint32_t u32Inst, ARM_POWER_STATE state)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;
    uint32_t u32RegLockLevel = SYS_IsRegLocked();

    // Check if the power state is valid
    if ((state != ARM_POWER_OFF)  &&
            (state != ARM_POWER_FULL) &&
            (state != ARM_POWER_LOW))
    {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    switch (state)
    {
        case ARM_POWER_OFF:
            SPI_InterruptConfig(u32Inst, SPI_OP_DISABLE); // Disable SPI interrupts

            // Reset SPI Run-Time Resources
            pSPIn->sState.sDrvStatus.u8Busy = 0U;
            pSPIn->sState.sDrvStatus.u8DataLost = 0U;
            pSPIn->sState.sDrvStatus.u8ModeFault = 0U;

            // Free PDMA channels
            if (pSPIn->spdma.i32RxChnId != -1)
            {
                nu_pdma_channel_free(pSPIn->spdma.i32RxChnId);
                pSPIn->spdma.i32RxChnId = -1;
            }

