OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_SPI/Driver_SPI.c
            if (pSPIn->spdma.i32TxChnId != -1)
            {
                nu_pdma_channel_free(pSPIn->spdma.i32TxChnId);
                pSPIn->spdma.i32TxChnId = -1;
            }

            pSPIn->sState.u8State &= ~SPI_POWERED; // SPI is not powered

            break;

        case ARM_POWER_FULL:
            if ((pSPIn->sState.u8State & SPI_INITIALIZED) == 0U)
            {
                return ARM_DRIVER_ERROR;
            }

            if ((pSPIn->sState.u8State & SPI_POWERED) != 0U)
            {
                return ARM_DRIVER_OK;
            }

            /* Unlock protected registers */
            if (u32RegLockLevel)
            {
                SYS_UnlockReg();
            }

            if ((pSPIn->spdma.u32TxUsed == 1) || (pSPIn->spdma.u32RxUsed == 1))
            {
                CLK_EnableModuleClock(PDMA0_MODULE);
                CLK_EnableModuleClock(PDMA1_MODULE);
            }

            // Reset SPI Run-Time Resources
            pSPIn->sState.sDrvStatus.u8Busy = 0U;
            pSPIn->sState.sDrvStatus.u8DataLost = 0U;
            pSPIn->sState.sDrvStatus.u8ModeFault = 0U;

            // Allocate PDMA RX channel if PDMA RX used
            if ((pSPIn->spdma.u32RxUsed == 1) &&
                    (pSPIn->spdma.i32RxChnId == -1))
            {
                pSPIn->spdma.i32RxChnId = nu_pdma_channel_allocate(
                                              pSPIn->spdma.u32RxPerIpMode,
                                              pSPIn->spdma.u32RxPort,
                                              pSPIn->spdma.u32RxChn);
            }

            // Allocate PDMA TX channel if PDMA TX used
            if ((pSPIn->spdma.u32TxUsed == 1) && (pSPIn->spdma.i32TxChnId == -1))
            {
                pSPIn->spdma.i32TxChnId = nu_pdma_channel_allocate(
                                              pSPIn->spdma.u32TxPerIpMode,
                                              pSPIn->spdma.u32TxPort,
                                              pSPIn->spdma.u32TxChn
                                          );
            }

            /* Lock protected registers */
            if (u32RegLockLevel)
            {
                SYS_LockReg();
            }

            if ((pSPIn->spdma.i32TxChnId == -1) ||
                    (pSPIn->spdma.i32RxChnId == -1))
            {
                // Free PDMA channels
                if (pSPIn->spdma.i32RxChnId != -1)
                {
                    nu_pdma_channel_free(pSPIn->spdma.i32RxChnId);
                    pSPIn->spdma.i32RxChnId = -1;
                }

                if (pSPIn->spdma.i32TxChnId != -1)
                {
                    nu_pdma_channel_free(pSPIn->spdma.i32TxChnId);
                    pSPIn->spdma.i32TxChnId = -1;
                }

            }

            SPI_InterruptConfig(u32Inst, SPI_OP_ENABLE); // Enable SPI interrupts

            SPI_ENABLE(phspi);

            pSPIn->sState.u8State |= SPI_POWERED;  // SPI is powered
            break;

        case ARM_POWER_LOW:

            // Check if the SPI is already initialized
            if (!(pSPIn->sState.u8State & SPI_INITIALIZED)) return ARM_DRIVER_ERROR;

            return ARM_DRIVER_ERROR_UNSUPPORTED;

        default:
            return ARM_DRIVER_ERROR_UNSUPPORTED;
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SPI_Send (const void *data, uint32_t num)
  \brief       Start sending data to SPI transmitter.
  \param[in]   data  Pointer to buffer with data to send to SPI transmitter
  \param[in]   num   Number of data items to send
  \return      \ref execution_status
*/
static int32_t SPIn_Send(uint32_t u32Inst, const void *data, uint32_t num)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;

    // Check if data and num are valid
    if ((data == NULL) || (num == 0U))
    {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    // Check if SPI is configured
    if (!(pSPIn->sState.u8State & SPI_CONFIGURED))
    {
        return ARM_DRIVER_ERROR;
    }

    // Check if SPI is busy
    if (pSPIn->sState.sDrvStatus.u8Busy)
    {
        return ARM_DRIVER_ERROR_BUSY;
    }

    // Set SPI status
    pSPIn->sState.sDrvStatus.u8Busy = 1U;
    pSPIn->sState.sDrvStatus.u8DataLost = 0U;
    pSPIn->sState.sDrvStatus.u8ModeFault = 0U;

    // Set transfer buffers and count
    pSPIn->sXfer.pu8RxBuf = NULL;
    pSPIn->sXfer.pu8TxBuf = (uint8_t *)(uint32_t)data;
    pSPIn->sXfer.u32Num = num;
    pSPIn->sXfer.u32RxCnt = 0U;
    pSPIn->sXfer.u32TxCnt = 0U;

    if (pSPIn->sConfig.u32XferMode == RTE_SPI_HALF_XFER_MODE)
    {
        phspi->CTL |= SPI_CTL_HALFDPX_Msk;
        phspi->CTL |= SPI_CTL_DATDIR_Msk; // Set TX mode
    }

    // Check if PDMA channel is available for TX
    if (pSPIn->spdma.i32TxChnId != -1)
    {
        if ((pSPIn->sXfer.pu8RxBuf == NULL) &&
                (pSPIn->sState.u32Mode & ARM_SPI_MODE_SLAVE))
        {
            // Dummy TX buffer for PDMA Send, even in Receive-only mode
            SPI_PrepareDefaultRxBuffer(pSPIn, ((phspi->CTL & SPI_CTL_DWIDTH_Msk) >> SPI_CTL_DWIDTH_Pos), num);
        }

        SPI_PDMA_RXInit(pSPIn);
        SPI_PDMA_TXInit(pSPIn);
        SPI_ClearIntFlag(phspi, SPI_GetActiveDataLostMask(pSPIn));
        SPI_EnableInt(phspi, SPI_GetActiveDataLostMask(pSPIn));
        /* Enable SPI master DMA function */
        SPI_TRIGGER_TX_RX_PDMA(phspi);
    }
    else
    {
        SPI_ClearIntFlag(phspi, SPI_GetActiveDataLostMask(pSPIn) | SPI_FIFO_TXTH_INT_MASK | SPI_FIFO_RXTO_INT_MASK);

        /* Set TX FIFO threshold, enable TX FIFO threshold interrupt and RX FIFO time-out interrupt */
        SPI_EnableInt(phspi, SPI_GetActiveDataLostMask(pSPIn) |
                  ((pSPIn->sConfig.u32XferMode == RTE_SPI_HALF_XFER_MODE) ?
                   SPI_FIFO_TXTH_INT_MASK :
                   (SPI_FIFO_TXTH_INT_MASK | SPI_FIFO_RXTO_INT_MASK)));
    }

    return ARM_DRIVER_OK;
}

/**
  \fn          int32_t SPI_Receive (void *data, uint32_t num)
  \brief       Start receiving data from SPI receiver.
  \param[out]  data  Pointer to buffer for data to receive from SPI receiver
  \param[in]   num   Number of data items to receive
  \return      \ref execution_status
*/
static int32_t SPIn_Receive(uint32_t u32Inst, void *data, uint32_t num)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;

    // Check for valid parameters
    if ((data == NULL) || (num == 0U))
    {
        return ARM_DRIVER_ERROR_PARAMETER;
    }

