OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_SPI/Driver_SPI.c
    // Check if the SPI is configured
    if (!(pSPIn->sState.u8State & SPI_CONFIGURED))
    {
        return 0U;
    }

    // If Rx buffer is used → Return RxCnt
    if (pSPIn->sXfer.pu8RxBuf != NULL)
    {
        if (pSPIn->spdma.i32RxChnId != -1)
        {
            pSPIn->sXfer.u32RxCnt = nu_pdma_transferred_byte_get(
                                        pSPIn->spdma.i32RxChnId, pSPIn->sXfer.u32Num * u32ItemSize) / u32ItemSize;
        }

        return pSPIn->sXfer.u32RxCnt;
    }
    else // Else fallback to TxCnt

        if (pSPIn->spdma.i32TxChnId != -1)
        {
            pSPIn->sXfer.u32TxCnt = nu_pdma_transferred_byte_get(
                                        pSPIn->spdma.i32TxChnId, pSPIn->sXfer.u32Num * u32ItemSize) / u32ItemSize;
        }

    return pSPIn->sXfer.u32TxCnt;
}

static int32_t SPIn_Control(uint32_t u32Inst, uint32_t control, uint32_t arg)
{
    SPI_RESOURCES *pSPIn = (SPI_RESOURCES *)spi_res_list[SPI_TO_SPI_INSTANCE(u32Inst)];
    SPI_T *phspi = (SPI_T *)pSPIn->phspi;
    uint32_t u32DataBits;
    volatile int32_t i32TimeoutCnt = (SystemCoreClock / 1000);

    if (!(pSPIn->sState.u8State & SPI_POWERED))
    {
        return ARM_DRIVER_ERROR;
    }

    // Check if the control command is to abort the transfer
    if ((control & ARM_SPI_CONTROL_Msk) == ARM_SPI_ABORT_TRANSFER)
    {
        // Terminate the TX DMA channel if it is in use
        if (pSPIn->spdma.i32TxChnId != -1)
            nu_pdma_channel_terminate(pSPIn->spdma.i32TxChnId);

        // Terminate the RX DMA channel if it is in use
        if (pSPIn->spdma.i32RxChnId != -1)
            nu_pdma_channel_terminate(pSPIn->spdma.i32RxChnId);

        // Disable TX and RX DMA
        SPI_DISABLE_TX_RX_PDMA(phspi);

        // Disable TX FIFO threshold, RX timeout, and data-lost related interrupts
        SPI_DisableInt(phspi, SPI_DATA_LOST_INT_MASK | SPI_FIFO_TXTH_INT_MASK | SPI_FIFO_RXTO_INT_MASK);

        // Clear the transfer information
        memset(&pSPIn->sXfer, 0, sizeof(SPI_TRANSFER_INFO));

        // Disable the SPI
        SPI_DISABLE(phspi);

        // Release the default TX buffer
        SPI_ReleaseDefaultTxBuffer(pSPIn);

        // Set the busy status to 0 (not busy)
        pSPIn->sState.sDrvStatus.u8Busy = 0U;

        return ARM_DRIVER_OK;
    }

    // Process according to the operation command
    switch (control & ARM_SPI_CONTROL_Msk)
    {
        case ARM_SPI_MODE_INACTIVE:
            pSPIn->sState.u32Mode &= ~ARM_SPI_CONTROL_Msk;
            pSPIn->sState.u32Mode |= ARM_SPI_MODE_INACTIVE;
            SPI_DISABLE(phspi);
            pSPIn->sState.u8State &= ~SPI_CONFIGURED;
            return ARM_DRIVER_OK;

        case ARM_SPI_MODE_MASTER:
        case ARM_SPI_MODE_SLAVE:
        {
            // Stop SPI and wait for SPIENSTS to be cleared
            SPI_DISABLE(phspi);
            i32TimeoutCnt = (SystemCoreClock / 1000);

            while (phspi->STATUS & SPI_STATUS_SPIENSTS_Msk)
            {
                if (--i32TimeoutCnt <= 0)
                    return ARM_DRIVER_ERROR;
            }

            // Clear control settings
            phspi->CTL = 0;
            phspi->SSCTL = 0;

            if ((control & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_MASTER)
            {
                phspi->CTL |= SPI_MASTER;
                pSPIn->sState.u32Mode &= ~ARM_SPI_CONTROL_Msk;
                pSPIn->sState.u32Mode |= ARM_SPI_MODE_MASTER;
                goto set_speed;
            }
            else
            {
                phspi->CTL |= SPI_SLAVE;
                phspi->CLKDIV = 2;

                if (pSPIn->sConfig.u32XferMode == RTE_SPI_3WIRE_XFER_MODE)
                {
                    phspi->SSCTL |= SPI_SSCTL_SLV3WIRE_Msk;
                }

                pSPIn->sState.u32Mode &= ~ARM_SPI_CONTROL_Msk;
                pSPIn->sState.u32Mode |= ARM_SPI_MODE_SLAVE;
                break;
            }
        }

        case ARM_SPI_SET_BUS_SPEED:
set_speed:
            pSPIn->sConfig.u32BusSpeed = SPI_SetBusClock(phspi, arg);

            if (pSPIn->sConfig.u32BusSpeed == 0)
                return ARM_DRIVER_ERROR;

            if ((control & ARM_SPI_CONTROL_Msk) == ARM_SPI_SET_BUS_SPEED)
                return ARM_DRIVER_OK;

            break;

        case ARM_SPI_GET_BUS_SPEED:
            return pSPIn->sConfig.u32BusSpeed;

        case ARM_SPI_SET_DEFAULT_TX_VALUE:
            pSPIn->sXfer.u32DefVal = arg;
            return ARM_DRIVER_OK;

        case ARM_SPI_CONTROL_SS:
            if ((arg != ARM_SPI_SS_ACTIVE) && (arg != ARM_SPI_SS_INACTIVE))
            {
                return ARM_DRIVER_ERROR_PARAMETER;
            }

            if ((pSPIn->sState.u32Mode & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_MASTER &&
                    (pSPIn->sState.u32Mode & ARM_SPI_SS_MASTER_MODE_Msk) == ARM_SPI_SS_MASTER_SW)
            {

                SPI_DisableAutoSS(phspi);
                (arg == ARM_SPI_SS_INACTIVE) ? SPI_SET_SS_HIGH(phspi) : SPI_SET_SS_LOW(phspi);
                return ARM_DRIVER_OK;
            }

            if ((pSPIn->sState.u32Mode & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_SLAVE &&
                    (pSPIn->sState.u32Mode & ARM_SPI_SS_SLAVE_MODE_Msk) == ARM_SPI_SS_SLAVE_SW)
            {

                SPI_DisableAutoSS(phspi);
                (arg == ARM_SPI_SS_INACTIVE) ? SPI_SET_SS_HIGH(phspi) : SPI_SET_SS_LOW(phspi);
                return ARM_DRIVER_OK;
            }

            return ARM_DRIVER_ERROR;

        default:
            return ARM_DRIVER_ERROR_PARAMETER;
    }

    // SS Master mode configuration
    if ((pSPIn->sState.u32Mode & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_MASTER)
    {
        switch (control & ARM_SPI_SS_MASTER_MODE_Msk)
        {
            case ARM_SPI_SS_MASTER_UNUSED:
                SPI_DisableAutoSS(phspi);
                phspi->SSCTL |= SPI_SSCTL_SLV3WIRE_Msk;
                pSPIn->sState.u32Mode &= ~ARM_SPI_SS_MASTER_MODE_Msk;
                pSPIn->sState.u32Mode |= ARM_SPI_SS_MASTER_UNUSED;
                break;

            case ARM_SPI_SS_MASTER_HW_INPUT:
                return ARM_SPI_ERROR_SS_MODE;

            case ARM_SPI_SS_MASTER_SW:
                SPI_DisableAutoSS(phspi);
                pSPIn->sState.u32Mode &= ~ARM_SPI_SS_MASTER_MODE_Msk;
                pSPIn->sState.u32Mode |= ARM_SPI_SS_MASTER_SW;
                break;

            case ARM_SPI_SS_MASTER_HW_OUTPUT:
                SPI_EnableAutoSS(phspi, SPI_SS, SPI_SS_ACTIVE_LOW);
                pSPIn->sState.u32Mode &= ~ARM_SPI_SS_MASTER_MODE_Msk;
                pSPIn->sState.u32Mode |= ARM_SPI_SS_MASTER_HW_OUTPUT;
                break;

            default:
                break;
        }
    }

    // SS Slave mode configuration
    if ((pSPIn->sState.u32Mode & ARM_SPI_CONTROL_Msk) == ARM_SPI_MODE_SLAVE)
    {
        switch (control & ARM_SPI_SS_SLAVE_MODE_Msk)
        {
            case ARM_SPI_SS_SLAVE_HW:
                SPI_EnableAutoSS(phspi, SPI_SS, SPI_SS_ACTIVE_LOW);
                pSPIn->sState.u32Mode &= ~ARM_SPI_SS_SLAVE_MODE_Msk;
                pSPIn->sState.u32Mode |= ARM_SPI_SS_SLAVE_HW;
                break;

            case ARM_SPI_SS_SLAVE_SW:
                if ((arg != ARM_SPI_SS_ACTIVE) && (arg != ARM_SPI_SS_INACTIVE))
                {
                    return ARM_DRIVER_ERROR_PARAMETER;
                }

                SPI_DisableAutoSS(phspi);
                (arg == ARM_SPI_SS_INACTIVE) ? SPI_SET_SS_HIGH(phspi) : SPI_SET_SS_LOW(phspi);
                pSPIn->sState.u32Mode &= ~ARM_SPI_SS_SLAVE_MODE_Msk;
                pSPIn->sState.u32Mode |= ARM_SPI_SS_SLAVE_SW;
                break;
        }
    }

    // Frame Format
    switch (control & ARM_SPI_FRAME_FORMAT_Msk)
    {
        case ARM_SPI_CPOL0_CPHA0:
            phspi->CTL = (phspi->CTL & ~(SPI_CTL_CLKPOL_Msk | SPI_CTL_TXNEG_Msk | SPI_CTL_RXNEG_Msk)) | SPI_MODE_0;
            break;

